#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # cloudflare_record.test2[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "cloudflare_record" "test2" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "test2"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = false
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "A"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "1.1.1.1"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = "3c1de2a3c9c1e2410436b346819015b9"
    }

[1m  # cloudflare_record.www[0m will be created[0m[0m
[0m[32m  +[0m [0mresource "cloudflare_record" "www" {
      [32m+[0m [0m[1m[0mcreated_on[0m[0m  = (known after apply)
      [32m+[0m [0m[1m[0mhostname[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mmetadata[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mmodified_on[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m        = "test"
      [32m+[0m [0m[1m[0mproxiable[0m[0m   = (known after apply)
      [32m+[0m [0m[1m[0mproxied[0m[0m     = false
      [32m+[0m [0m[1m[0mttl[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mtype[0m[0m        = "A"
      [32m+[0m [0m[1m[0mvalue[0m[0m       = "1.1.1.1"
      [32m+[0m [0m[1m[0mzone_id[0m[0m     = "3c1de2a3c9c1e2410436b346819015b9"
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.[0m

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @FelixKlauke, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*